{
  "title" : "Constitution of the Republic of Sierra Leone",
  "schedules" : [
    {
      "title" : "FIRST SCHEDULE",
      "items":  [
        {
          "header": "Part 1",
          "content" : "\"I, ______________________ do hereby (in the name of God swear) (solemnly affirm) that I will at all times well and truly discharge the duties of the office of the President of the Republic of Sierra Leone according to law, that I will preserve, support, uphold, maintain and defend the Constitution of the Republic of Sierra Leone as by law established, and that I will do right to all manner of people according to law, without fear or favour, affection or ill-will. (So help me God.)\""
        }
      ]
    }
  ],
  "chapters": [
    {
      "title": "THE REPUBLIC OF SIERRA LEONE",
      "number": 1,
      "sections": [
        {
          "number": 1,
          "title": "Declaration of Republic",
          "content": "Sierra Leone is a Sovereign Republic, the boundaries of which are delimited in the First Schedule hereto."
        },
        {
          "number": 2,
          "title": "Public seal",
          "content": "The Public Seal of the Republic shall be such a device as Parliament shall prescribe"
        },
        {
          "number": 3,
          "title": "The National Flag and National Anthem.",
          "content": "(1) (a) The Flag of which the design is described in paragraph (b) hereof is hereby declared to be the National Flag of Sierra Leone\n\n(a) The design of the Flag shall be from the top of the Flag to the bottom thereof, three horizontal stripes of green, white and blue.\n\n(b) The normal size of the Flag for official use shall be in the proportion of nine units across to six units down.\n\n(2) The National Anthem of the Republic shall be such as Parliament shall prescribe."
        }
      ]
    },
    {
      "title": "FUNDAMENTAL PRINCIPLES OF STATE POLICY",
      "number": 2,
      "sections": [
        {
          "number": 4,
          "title": "Fundamental obligations of Government.",
          "content": "All organs of Government and all authorities and persons exercising legislative, executive or judicial powers shall conform to, observe and apply the provisions of this Chapter"
        },
        {
          "number": 5,
          "title": "Government and the people",
          "content": "(1) The Republic of Sierra Leone shall be a State based on the principles of Freedom, Democracy and Justice.\n\n(2) It is accordingly declared that—\n\n(a) sovereignty belongs to the people of Sierra Leone from whom Government through this Constitution derives all its powers, authority and legitimacy;\n\n(b) the security, peace and welfare of the people of Sierra Leone shall be the primary purpose and responsibility of Government, and to this end it shall be the duty of the Armed Forces, the Police, Public Officers and all security agents to protect and safeguard the people of Sierra Leone; and\n\n(c) the participation of the people in the governance of the State shall be ensured in accordance with the provisions of this Constitution."
        },
        {
          "number": 6,
          "title": "Political objectives",
          "content": "(1) The motto of the Republic of Sierra Leone shall be Unity, Freedom and Justice.\n\n(2) Accordingly, the State shall promote national integration and unity and discourage discrimination on the grounds of place of origin, circumstance of birth, sex, religion, status, ethnic or linguistic association or ties.\n\n(3) For the purposes of promoting national integration and unity, the State shall—\n\n(a) provide adequate facilities for and encourage free mobility of people, goods and services throughout Sierra Leone; and\n\n(b) secure full rights of residence for every citizen in all parts of the State.\n\n(4) The State shall protect and defend the liberty of the individual, enforce the rule of law and ensure the efficient functioning of Government services.\n\n(5) The State shall take all steps to eradicate all corrupt practices and the abuse of power."
        },
        {
          "number": 7,
          "title": "Economic objectives",
          "content": "(1) The State shall within the context of the ideals and objectives for which provisions are made in this Constitution—\n\n(a) harness all the natural resources of the nation to promote national prosperity and an efficient, dynamic and self-reliant economy;\n\n(b) manage and control the national economy in such a manner as to secure the maximum welfare and freedom of every citizen on the basis of social justice and equality of opportunity;\n\n(c) protect the right of any citizen to engage in any economic activity without prejudice to the rights of any other person to participate in areas of the economy;\nplace proper and adequate emphasis on agriculture in all its aspects so as to ensure self-sufficiency in food production; and\n\n(d) ensure that Government shall always give priority and encouragement to Sierra Leoneans to participate in all spheres of the economy in furtherance of these objectives."
        },
        {
          "number": 8,
          "title": "Social objectives",
          "content": "(1) The Social Order of the State shall be founded on the ideals of Freedom, Equality and Justice.\n\n(2) In furtherance of the Social Order—\n\n(a) every citizen shall have equality of rights, obligations, and opportunities before the law, and the State shall ensure that every citizen has an equal right to all opportunities and benefits based on merit;\n\n(b) the State shall recognise, maintain and enhance the sanctity of the human person and human dignity; and\n\n(c) the Government shall secure and maintain the independence, impartiality and integrity of courts of law and unfettered access thereto, and to this end shall ensure that the operation of the legal system promotes justice on the basis of equal opportunity, and that opportunities for securiting justice are not denied any citizen by reason of economic or other disability.\n\n(3) The State shall direct its policy towards ensuring that—\n\n(a) every citizen, without discrimination on any grounds whatsoever, shall have the opportunity for securing adequate means of livelihood as well as adequate opportunities to secure suitable employment;\n\n(b) conditions of service and work are fair, just and humane and that there are adequate facilities for leisure and for social, religious and cultural life;\n\n(c) the health, safety and welfare of all persons in employment are safeguarded and not endangered or abused, and in particular that special provisions be made for working women with children, having due regard to the resources of the State;\n\n(d) there are adequate medical and health facilities for all persons, having due regard to the resources of the State;\nthere is equal pay for equal work without discrimination on account of sex, and that adequate and satisfactory remuneration is paid to all persons in employment; and\n\n(e) the care and welfare of the aged, young and disabled shall be actively promoted and safeguarded."
        },
        {
          "number": 9,
          "title": "Educational objectives",
          "content": "(1) The Government shall direct its policy towards ensuring that there are equal rights and adequate educational opportunities for all citizens at all levels by—\n\n(a) ensuring that every citizen is given the opportunity to be educated to the best of his ability, aptitude and inclination by providing educational facilities at all levels and aspects of education such as primary, secondary, vocational, technical, college and university;\n\n(b) safeguarding the rights of vulnerable groups, such as children, women and the disabled in security educational facilities; and\nproviding the necessary structures, finance and supportive facilities for education as and when practicable.\n\n(2) The Government shall strive to eradicate illiteracy, and to this end, shall direct its educational policy towards achieving—\n\n(a) free adult literacy programmes;\n\n(b) free compulsory basic education at primary and junior secondary school levels; and\n\n(c) free senior secondary education as and when practicable.\n\n(3) The Government shall promote the learning of indigenous languages and the study and application of modern science, foreign languages, technology, commerce and business."
        },
        {
          "number": 10,
          "title": "Foreign policy objectives",
          "content": "The Foreign Policy Objectives of the State Shall be—\n\n(a) the promotion and protection of the National interest;\n\n(b) the promotion of sub-regional, regional and inter-African co-operation and unity;\n\n(c) the promotion of international co-operation for the consolidation of international peace and security and mutual respect among all nations; and respect for their territorial integrity and independence; and\n\n(d) respect for international law and treaty obligations, as well as the seeking of settlement of international disputes by negotiation, conciliation, arbitration or adjudication."
        },
        {
          "number": 11,
          "title": "Obligations of the mass media",
          "content": "The press, radio and television and other agencies of the mass media shall at all times be free to uphold the fundamental objectives contained in this Constitution and highlight the responsibility and accountability of the Government to the people."
        },
        {
          "number": 12,
          "title": "Enhancement of national culture",
          "content": "The Government shall—\n\n(a) promote Sierra Leonean culture such as music, art, dance, science, philosophy, education and traditional medicine which is compatible with national development;\n\n(b) recognize traditional Sierra Leonean institutions compatible with national development;\n\n(c) protect and enhance the cultures of Sierra Leone; and\n\n(d) facilitate the provision of funds for the development of culture in Sierra Leone.\n\n"
        },
        {
          "number": 13,
          "title": "Duties of the citizen.",
          "content": "Every citizen shall—\n\n(a) abide by this Constitution, respect its ideals and its institutions, the National Flag, the National Anthem and authorities and offices established constituted under this Constitution or any other law;\n\n(b) cultivate a sense of nationalism and patriotism so that loyalty to the State shall override sectional, ethnic tribal or other loyalties;\n\n(c) protect and preserve public property and prevent the misappropriation and squandering of funds belonging to the Government, local authorities or public corporations;\n\n(d) help enhance the power, prestige and good name of the State and to defend the State and tender national service as may be required;\n\n(e) respect the dignity and religious of other individuals, and the rights and interests of others;\n\n(f) make positive and useful contributions to the advancement, progress, and well-being of the community, wherever he resides;\n\n(g) work conscientiously in a lawful and chosen occupation and abstain from any activity detrimental to the general welfare of others;\n\n(h) ensure the proper control and upbringing of his children and wards;\n\n(i) participate in and defend all democratic processes and practices; and\n\n(j) render assistance to appropriate and lawful agencies in the maintenance of law and order.\n\n"
        },
        {
          "number": 14,
          "title": "Fundamental principles not justicable",
          "content": "Notwithstanding the provisions of Section 4, the provisions contained in this Chapter shall not confer legal rights and shall not be enforceable in any court of law, but the principles contained therein shall nevertheless be fundamental in the governance of the State, and it shall be the duty of Parliament to apply these principles in making laws."
        }
      ]
    },
    {
      "title": "THE RECOGNITION AND PROTECTION OF FUNDAMENTAL HUMAN RIGHTS AND FREEDOMS OF THE INDIVIDUAL",
      "number": 3,
      "sections": [
        {
          "number": 15,
          "title": "Fundamental human rights and freedoms of the individual.",
          "content": "Whereas every person in Sierra Leone is entitled to the fundamental human rights and freedoms of the individual, that is to say, has the right, whatever his race, tribe, place of origin, political opinion, colour, creed or sex, but subject to respect for the rights and freedoms of others and for the public interest, to each and all of the following—\n\n(a) life, liberty, security of person, the enjoyment of property, and the protection of law;\n\n(b) freedom of conscience, of expression and of assembly and association;\n\n(c) respect for private and family life, and\n\n(d) protection from deprivation of property without compensation;\n\n(e) the subsequent provisions of this Chapter shall have effect for the purpose of affording protection to the aforesaid rights and freedoms, subject to such limitations of that protection as are contained in those provisions, being limitations designed to ensure that the enjoyment of the said rights and freedoms by any individual does not prejudice the rights and freedoms of others, or the public interest."
        },
        {
          "number": 16,
          "title": "Protection of right to life.",
          "content": "(1) No person shall be deprived of his life intentionally except in execution of the sentence of a court in respect of a criminal offence under the laws of Sierra Leone, of which he has been convicted.\n\n(2) Without prejudice to any liability for a contravention of any other law with respect to the use of force in such cases as are hereinafter mentioned, a person shall not be regarded as having been deprived of his life in contravention of this section if he dies as a result of the use of force to such extent as is reasonably justifiable in the circumstances of the case, that is to say—\n\n(a) for the defence of any person from unlawful violence or for the defence of property; or\n\n(b) in order to effect a lawful arrest or to prevent the escape of a person lawfully detained; or\n\n(c) for the purpose of suppressing a riot, insurrection or mutiny; or\n\n(d) in order to prevent the commission by that person of a criminal offence; or\n\n(e) if he dies as a result of a lawful act of war."
        },
        {
          "number": 17,
          "title": "Protection from arbitrary arrest or detention.",
          "content": "(1) No person shall be deprived of his personal liberty except as may be authorised by law in any of the following cases, that is to say —\n\n(a) in consequence of his unfitness to plead to a criminal charge; or\n\n(b) in the execution of a sentence or order of a Court whether in Sierra Leone or elsewhere in respect of a criminal offence of which he has been convicted; or\n\n(c) in the execution of an order of the High Court or the Court of Appeal or the Supreme Court or such other court as may be prescribed by Parliament on the grounds of his contempt of any such court or of another court or tribunal or commission of inquiry as the case may be; or\n\n(d) in the execution of an Order of a court made in order to secure the fulfilment of any obligation imposed on him by law; or\n\n(e) for the purpose of bringing him before a court or tribunal, as the case may be, in execution of the order of a court; or\n\n(f) upon reasonable suspicion of his having committed or of being about to commit a criminal offence; or\n\n(g) in the case of a person who has not attained the age of twenty-one years, for the purpose of his education or welfare; or\n\n(h) for the purpose of preventing the spread of an infectious or contagious disease; or\n\n(i) in the case of a person who is, or is reasonably suspected to be, of unsound mind, addicted to drugs or alcohol, or a vagrant, for the purpose of his care or treatment or the protection of the community; or\n\n(j) for the purpose of preventing the unlawful entry of that person into Sierra Leone, or for the purpose of effecting the expulsion, extradition or other lawful removal of that person from Sierra Leone or the taking of proceedings thereto.\n\n(2) Any person who—\n\n(a) is arrested or detained shall be informed in writing or in a language that he understands at the time of his arrest, and in any event not later than twenty-four hours, of the facts and grounds for his arrest or detention;\n\n(b) is arrested or detained shall be informed immediately at the time of his arrest of his right of access to a legal practitioner or any person of his choice, and shall be permitted at his own expense to instruct without delay a legal practitioner of his own choice and to communicate with him confidentially.\n\n(3) Any person who is arrested or detained in such a case as is mentioned in paragraph (e) or (f) of subsection (1) and who is not released shall be brought before a court of law—\n\n(a) within ten days from the date of arrest in cases of capital offences, offences carrying life imprisonment and economic and environmental offences; and\n\n(b) within seventy-two hours of his arrest in case of other offences;\n\nand if any person arrested or detained in such a case as is mentioned in the said paragraph (f) is not tried within the periods specified in paragraph (a) or (b) of this section, as the case may be, then without prejudice to any further proceedings which may be brought against him he shall be released either unconditionally or upon reasonable conditions, including in particular, such conditions as are reasonably necessary to ensure that he appears at a later date for trial or proceedings preliminary to trial.\n\n(4) Any person who is unlawfully arrested or detained by any other person shall be entitled to compensation therefor from that other person."
        },
        {
          "number": 18,
          "title": "Protection of freedom of movement.",
          "content": "(1) No person shall be deprived of his freedom of movement, and for the purpose of this section the said freedom means the right to move freely throughout Sierra Leone, the right to reside in any part of Sierra Leone, the right to enter or leave Sierra Leone, and immunity from expulsion form Sierra Leone.\n\n(2) Any restriction on a person's freedom of movement which is involved in his lawful detention shall not be held to be inconsistent with or in contravention of this section.\n\n(3) Nothing contained in or done under authority of any law shall be held to be inconsistent with or in contravention of this section to the extent that the law in question makes provision—\n\n(a) which is reasonably required in the interests of defence, public safety, public order, public morality, public health or the conservation of the natural resources, such as mineral, marine, forest and other resources of Sierra Leone, except in so far as that provision or, as the case may be, the thing done under the authority thereof is shown not to be reasonably justifiable in a democratic society; or\n\n(b) for the imposition of restrictions on the movement or residence within Sierra Leone of any person who is not a citizen thereof or the exclusion of expulsion from Sierra Leone of any such persons; or\n\n(c) for the imposition of restrictions on the acquisition or use by any person of land or other property in Sierra Leone; or\n\n(d) for the imposition of restrictions upon the movement or residence within Sierra Leone of public officers or members of a defence force; or\n\n(e) for the removal of a person from Sierra Leone to be tried outside Sierra Leone for a criminal offence recognised as such by the laws of Sierra Leone, or to serve a term of imprisonment outside Sierra Leone in the execution of the sentence of a court in respect of a criminal offence of which he has been convicted; or\n\n(f) for preventing the departure from Sierra Leone of a person who is reasonably suspected of having committed a crime or seeking to evade the fulfilment of an obligation imposed on him under the civil law or to evade military service:\n\nProvided that no court or other authority shall prohibit any such person from entering into or residing in any place to which he is indigenous;or\n\n(g) for restricting vagrancy."
        },
        {
          "number": 19,
          "title": "Protection from slavery and forced labour.",
          "content": "(1) No person shall be held in slavery or servitude or be required to perform forced labour or traffic or deal in human beings.\n\n(2) For the purposes of this section the expression \"forced labour\" does not include—\n\n(a) any labour required in consequence of a sentence or order of a court, or\n\n(b) labour required of any person while he is lawfully detained, which though not required in consequence of the sentence or order of a court, is reasonably necessary in the interest of hygiene or for the maintenance of the place in which he is detained; or\n\n(c) any labour required of a member of a defence force in pursuance of his duties as such or, in the case of a person who has conscientious objections to service as such a member, any labour which that person is required by law to perform in place of such service; or\n\n(d) any labour required during a period of public emergency or calamity which threatens the life of well-being of the community; or\n\n(e) communal labour or labour which forms part of other civic obligation."
        },
        {
          "number": 20,
          "title": "Protection from inhuman treatment.",
          "content": "(1) No person shall be subject to any form of torture or any punishment or other treatment which is inhuman or degrading.\n\n(2) Nothing contained in or done under the authority of any law shall be held to be inconsistent with or in contravention of this section to the extent that the law in question authorises the infliction of any kind of punishment which was lawful immediately before the entry into force of this Constitution."
        },
        {
          "number": 21,
          "title": "Protection from deprivation of property.",
          "content": "(1) No property of any description shall be compulsorily taken possession of, and no interest in or right over property of any description shall be compulsorily acquired, except where the following conditions are satisfied, that is to say—\n\n(a) the taking of possession or acquisition is necessary in the interests of defence, public safety, public order, public morality, public health, town and country planning, the development or utilization of any property in such a manner as to promote the public benefit or the public welfare of citizens of Sierra Leone; and\n\n(b) the necessity therefore is such as to afford reasonable justification for the causing of any hardship that may result to any person having any interest in or right over the property; and\n\n(c) provision is made by law applicable to that taking of possession or acquisition—\n\n(i) for the prompt payment of adequate compensation; and\n\n(ii) securing to any person having an interest in or right over the property, a right of access to the court or other impartial and independent authority for the determination of his interest or right, the legality of the taking of possession or acquisition of the property, interest or right, and the amount of any compensation to which he is entitled and for the purpose of obtaining prompt payment of that compensation.\n\n(2) Nothing in this section shall be construed as affecting the making or operation of any law in so far as it provides for the taking of possession or acquisition of property—\n\n(a) in satisfaction of any tax, rate or due;\n\n(b) by way of penalty for breach of the law whether under civil process or after conviction of a criminal offence\n\n(c) as an incident of a lease, tenancy, mortgage charge, bill of sale, pledge or contract;\nby way of the vesting or administration of trust property, enemy property; bona vacantia, property of prohibited aliens, or the property of persons adjudged or otherwise declared bankrupt or insolvent, persons of unsound mind, deceased persons, or bodies corporate or incorporate in the course of being wound up;\n\n(d) in the execution of judgements or orders of courts;\n\n(e) by reason of such property being in a dangerous state or liable to cause injuries to the health of human beings, animals or plants;\n\n(f) in consequence of any law with respect to the limitation of actions;\n\n(g) for so long only as such taking possession may be necessary for the purposes of any examination, investigation, trial, or inquiry, or, in the case of land, the carrying out thereon—\n\n(i) of work of soil conservation or the conservation of other natural resources\n\n(ii) of agricultural development or improvement which the owner or occupier of the land has been required, and has without reasonable or lawful excuse refused or failed to carry out.\n\n(3) Nothing in this section shall be construed as affecting the making or operation of any law for the compulsory taking of possession in the public interest of any property or the compulsory acquisition in the public interest in or right over property, where that property, interest or right is held by a body corporate which is established directly by any law and in which no moneys have been invested other than moneys proved by Parliament or by the Legislature of the former Colony and Protectorate of Sierra Leone.\n\n(4) Any such property of whatever description compulsorily taken possession of, and any interest in, or right over, property of any description compulsorily acquired in the public interest or for public purposes, shall be used only in the public interest or for the public purposes for which it is taken or acquired.\n\n(5) Where any such property as is referred to in subsection (4) is not used in the public interest or for the public purposes for which it was taken or acquired, the person who was the owner immediately before the compulsory taking or acquisition, as the case may be, shall be given the first option of acquiring that property, in which event he shall be required to refund the whole or such part of the compensation as may be agreed upon between the parties thereto: and in the absence of any such agreement such amount as shall be determined by the High Court."
        },
        {
          "number": 22,
          "title": "Protection for privacy of home and other property.",
          "content": "(1) Except with his own consent, no person shall be subjected to the search of his person or his property or the entry by others on his premises, or interference with his correspondence, telephone conversations and telegraphic and electronic communications.\n\n(2) Nothing contained in or done under authority of any law shall be held to be inconsistent with or in contravention of this section to the extent that the law in question makes provision that is reasonably required—\n\n(a) in the interest of defence, public safety, public order, public morality, public health, town and country planning, or the development or utilization of any property in such a manners as to promote the public benefit; or\n\n(b) to enable any body corporate established directly by any law or any department of the Government or any local authority to enter on the premises of any person in order to carry out work in connection with any property or installation which is lawfully on such premises and which belongs to that body corporate or to the Government or to that authority, as the case may be; or\n\n(c) for the purpose of protecting the rights and freedoms of other persons; or\n\n(d) for the purpose of executing any judgement or order of a court; or\n\n(e) for the purpose of affording such special care and assistance as are necessary for the health, safety, development and well-being of women, children and young persons, the aged and the handicapped;\n\nand except in so far as that provision or, as the case may be, the thing done under authority thereof is shown not to be reasonably justifiable in a democratic society."
        },
        {
          "number": 23,
          "title": "Provision to secure protection of law.",
          "content": "(1) Whenever any person is charged with a criminal offence he shall unless the charge is withdrawn, be afforded a fair hearing within a reasonable time by an independent and impartial court established by law.\n\n(2) Any court or other authority prescribed by law for the determination of the existence or extent of civil rights or obligations shall be independent and impartial; and where proceedings for such determination are instituted by or against any person or authority or the Government before such court or authority, the case shall be given fair hearing within a reasonable time.\n\n(3) All proceedings of every court and proceedings relating to the determination of the existence or the extent of civil rights or obligations before any court or other authority, including the announcement of the decision of the court or other authority, shall be held in public:\n\nProvided that the court or other authority may, to such an extent as it may consider necessary or expedient in circumstances where publicity would prejudice the interest of justice or interlocutory civil proceedings or to such extent as it may be empowered or required by law so to do in the interest of defence, public safety, public order, public morality, the welfare of persons under the age of twenty-one years or the protection of the private lives of persons concerned in the proceedings, exclude from its proceedings, persons other than the parties thereto and their legal representatives.\n\n(4) Every person who is charged with a criminal offence shall be presumed to be innocent until he is proved, or has pleaded guilty:\n\nProvided that nothing contained in or done under the authority of any law shall be held to be inconsistent with or in contravention of this subsection, to the extent that the law in question imposes on any person charged as aforesaid the burden of proving particular facts.\n\n(5) Every person who is charged with a criminal offence—\n\n(a) shall be informed at the time he is charged in the language which he understands and in detail, of the nature of the offence charged;\n\n(b) shall be given adequate time and facilities for the preparation of his defence;\n\n(c) shall be permitted to defend himself in person or by a legal practitioner of his own choice;\n\n(d) shall be afforded facilities to examine in person or by his legal practitioner the witnesses called by the prosecution before any court and to obtain the attendance and carry out the examination of witnesses to testify on his behalf before the court on the same conditions as those applying to witnesses called by the prosecution; and\n\n(e) shall be permitted to have without payment the assistance of an interpreter if he cannot understand the language used at the trial of the charge:\n\nProvided that nothing contained in or done under the authority of any law shall be held to be inconsistent with or in contravention of this subsection to the extent that the law in question prohibits legal representation in a Local Court.\n\n(6) When a person is tried for any criminal offence, the accused person or any person authorised by him in that behalf shall if he so requires, and subject to the payment of such reasonable fee as may be prescribed by law, be given within a reasonable time, and in any event not more than three months after trial, a copy for the use of the accused person of any record of the proceedings made by or on behalf of the court.\n\n(7) No person shall be held to be guilty of a criminal offence on account of any act or omission which did not, at the time it took place, constitute such an offence.\n\n(8) No penalty shall be imposed for any criminal offence which is severer in degree or description than the maximum penalty which might have been imposed for that offence at the time when it was committed.\n\n(9) No person who shows that he has been tried by any competent court for a criminal offence and either convicted or acquitted shall again be tried for that offence or for any other offence of which he could have been convicted at the trial for that offence save upon the order of a superior court made in the court of appeal proceedings relating to the conviction or acquittal; and no person shall be tried for a criminal offence if he shows that he has been pardoned for that offence:\n\nProvided that nothing in any law shall be held to be inconsistent with or in contravention of this subsection by reason only that it authorises any court to try a member of a defence force for a criminal offence notwithstanding any trial and conviction or acquittal of that member under service law; but any court so trying such a member and convicting him shall in sentencing him to any punishment take into account any punishment awarded him under service law.\n\n(10) Nothing contained in or done under the authority of any law shall be held to be inconsistent with or in contravention of any provisions of this section, other than subsections (7) and (8), to the extent that the law in question authorises the taking during a period of public emergency of measures that are reasonably justifiable for the purpose of dealing with the situation that exists before or during that period of public emergency.\n\n(11) In paragraphs (c) and (d) of subsection (5), the expression \"legal practitioner\" means a person entitled to practise as a Barrister and Solicitor of the High Court."
        },
        {
          "number": 24,
          "title": "Protection of freedom of conscience.",
          "content": "(1) Except with his own consent, no person shall be hindered in the enjoyment of his freedom of conscience and for the purpose of this section the said freedom includes freedom of thought and of religion, freedom to change his religion or belief, and freedom either alone or in community with others and both in public and in private to manifest and propagate his religion or belief in worship, teaching, practice and observance.\n\n(2) Except with his own consent (or if he is a minor the consent of his parent or guardian) no person attending any place of education shall be required to receive religious instruction or to take part in or to attend any religious ceremony or observance if that instruction, ceremony or observance relates to a religion other than his own.\n\n(3) No religious community or denomination shall be prevented from providing religious instruction for persons of that community or denomination in the course of any education provided by that community or denomination.\n\n(4) No person shall be compelled to take any oath which is contrary to his religion or belief or to take any oath in a manner which is contrary to his religion or belief.\n\n(5) Nothing contained in or done under the authority of any law shall be held to be inconsistent with or in contravention of this section to the extent that the law in question makes a provision which is reasonably required—\n\n(a) in the interest of defence, public safety, public order, public morality or public health; or\n\n(b) for the purpose of protecting the rights and freedoms of other persons including the right to observe and practice any religion without the unsolicited intervention of the members of any other religion;\n\n(c) and except in so far as that provision or, as the case may be, the thing done under the authority thereof, is shown not to be reasonably justifiable in a democratic society."
        },
        {
          "number": 25,
          "title": "Protection of freedom of expression and the press.",
          "content": "(1) Except with his own consent, no person shall be hindered in the enjoyment of his freedom of expression, and for the purpose of this section the said freedom includes the freedom to hold opinions and to receive and impart ideas and information without interference, freedom from interference with his correspondence, freedom to own, establish and operate any medium for the dissemination of information, ideas and opinions, and academic freedom in institutions of learning:\n\nProvided that no person other than the Government or any person or body authorised by the President shall own, establish or operate a television or wireless broadcasting station for any purpose whatsoever.\n\n(2) Nothing contained in or done under the authority of any law shall be held to be inconsistent with or in the contravention of this section to the extent that the law in question makes provision—\n\n(a) which is reasonably required—\n\n(i) in the interests of defence, public safety, public order, public morality or public health; or\n\n(ii) for the purpose of protecting the reputations, rights and freedoms of other persons, preventing the disclosure of information received in confidence, maintaining the authority and independence of the courts, or regulating the telephony, telegraphy, telecommunications, posts, wireless broadcasting, television, public exhibitions or public entertainment; or\n\n(b) which imposes restrictions on public officers or members of a defence force;\n\nand except in so far as that provision or, as the case may be, the thing done under the authority thereof, is shown not to be reasonably justifiable in a democratic society."
        },
        {
          "number": 26,
          "title": "Protection of freedom of assembly and association.",
          "content": "(1) Except with his own consent, no person shall be hindered in the enjoyment of his freedom of assembly and association, that is to say, his right to assemble freely and associate with other persons and in particular to form or belong to any political party, trade unions or other economic, social or professional associations, national or international, for the protection of his interests.\n\n(2) Nothing contained in or done under the authority of any law shall be held to be inconsistent with or in contravention of this section to the extent that the law in question makes provision—\n\n(a) which is reasonably required—\n\n(i) in the interests of defence, public safety, public order, public morality, public health, or provision for the maintenance of supplies and services essential to the life of the community; or\n\n(ii) for the purpose of protecting the rights and freedoms of other persons; or\n\n(b) which imposes restrictions upon public officers and upon members of a defence force; or\n\n(c) which imposes restrictions on the establishment of political parties, or regulates the organisation, registration, and functioning of political parties and the conduct of its members;\n\nand except in so far as that provision, or as the case may be, the thing done under the authority thereof is shown not to be reasonably justifiable in a democratic society."
        },
        {
          "number": 27,
          "title": "Protection from discrimination.",
          "content": "(1) Subject to the provisions of subsection (4), (5), and (7), no law shall make provision which is discriminatory either of itself or in its effect.\n\n(2) Subject to the provisions of subsections (6), (7), and (8), no person shall be treated in a discriminatory manner by any person acting by virtue of any law or in the performance of the function of any public office or any public authority.\n\n(3) In this section the expression \"discriminatory\" means affording different treatment to different persons attributable wholly or mainly to their respective descriptions by race, tribe, sex, place of origin, political opinions, colour or creed whereby persons of one such description are subjected to disabilities or restrictions to which persons of another such description are not made subject, or are accorded privileges or advantages which are not accorded to persons of another such description.\n\n(4) Subsection (1) shall not apply to any law so far as that law makes provision—\n\n(a) for the appropriation of revenues or other funds of Sierra Leone or for the imposition of taxation (including the levying of fees for the grant of licenses); or\n\n(b) with respect to persons who are not citizens of Sierra Leone; or\n\n(c) with respect to persons who acquire citizenship of Sierra Leone by registration or by naturalization or by resolution of Parliament; or\n\n(d) with respect to adoption, marriage, divorce, burial, devolution of property on death or other interests of personal law; or\n\n(e) for the application in the case of members of a particular race or tribe or customary law with respect to any matter to the exclusion of any law with respect to that matter which is applicable in the case of other persons; or\n\n(f) for authorising the taking during a period of public emergency of measures that are reasonably justifiable for the purpose of dealing with the situation that exists during that period of public emergency; or\n\n(g) whereby persons of any such description as mentioned in subsection (3) may be subjected to any disability or restriction or may be accorded any privilege or advantage which, having regard to its nature and to special circumstances pertaining to those persons or to persons of any other such description, is reasonably justifiable in a democratic society; or\n\n(h) for the limitation of citizenship or relating to national registration or to the collection of demographic statistics.\n\n(5) Nothing contained in any law shall be held to be inconsistent with or in contravention of subsection (1) to the extent that it makes provision with respect to qualifications for service as a public officer or as a member of a defence force or for the service of a local government authority or a body corporate established directly by any law or of membership of Parliament.\n\n(6) Subsection (2) shall not apply to anything which is expressly or by necessary implication authorised to be done by any such provisions of law as is referred to in subsection (4) or (5).\n\n(7) Nothing contained in or done under the authority of any law shall be held to be inconsistent with or in contravention of this section to the extent that the law in question makes provision whereby persons of any such description as is mentioned in subsection (3) may be subjected to any restriction of the rights and freedoms guaranteed by sections 18, 22, 24, 25 and 26 being such a restriction as is authorised by subsection (3) of section 18, subsection (2) of section 22, subsection (5) of section 24, subsection (2) of section 25 or subsection (2) of section 26, as the case may be.\n\n(8) The exercise of any discretion relating to the institution, conduct or discontinuance of civil or criminal proceedings in any court that is vested in any person under or by this Constitution or any other law shall not be enquired into by any Court on the grounds that it contravenes the provision of subsection (2)."
        },
        {
          "number": 28,
          "title": "Enforcement of protective provisions.",
          "content": "(1) Subject to the provisions of subsection (4), if any person alleges that any of the provisions of sections 16 to 27 (inclusive) has been, is being or is likely to be contravened in relation to him by any person (or, in the case of a person who is detained, if any other person alleges such a contravention in relation to the detained person), then, without prejudice to any other action with respect to the same matter which is lawfully available, that person, (or that other person), may apply by motion to the Supreme Court for redress.\n\n(2) The Supreme Court shall have original jurisdiction—\n\n(a) to hear and determine any application made by any person in pursuance of subjection (1); and\n\n(b) to determine any question arising in the case of any person which is referred to in pursuance of subsection (3), and may made such order, issue such writs, and give such directions as it may consider appropriate for the purpose of enforcing, or securing the enforcement of any of the provisions of the said sections 16 to 27 (inclusive) to the protection of which the person concerned is entitled:\n\nProvided that the Supreme Court shall not exercise its powers under this subsection if it is satisfied that adequate means of redress for the contravention alleged are or have been available to the person concerned under any other law.\n\n(3) If in any proceedings in any court other than the Supreme Court, any question arises as to the contravention of any of the provisions of sections 16 to 27 inclusive, that court may, and shall if any party to the proceedings so requests, refer the question to the Supreme Court.\n\n(4) The Rules of Court Committee may make rules with respect to the practice and procedure of the Supreme Court for the purposes of this section;\nParliament may confer upon the Supreme Court such powers in addition to those conferred by this section as may appear to Parliament to be necessary or desirable for the purpose of enabling the court more effectively to exercise the jurisdiction conferred upon it by this section.\n\n(5) Parliament shall make provision—\n\n(a) for the rendering of financial assistance to any indigent citizen of Sierra Leone where his right under this Chapter has been infringed, or with a view to enabling him to engage the services of a legal practitioner to prosecute his claim; and\n\n(b) for ensuring that allegations of infringements of such rights are substantial and the requirement or need for financial or legal aid is real.\n\n(6) The Supreme Court—\n\n(a) consisting of not less than five Justices of the Supreme Court shall consider every question referred to it under this Chapter for a decision, and, having heard arguments by or on behalf of the parties by Counsel, shall pronounce its decision on such question in open court as soon as may be and in any case not later than thirty days after the date of such reference;\n\n(b) shall for the purposes of this Chapter, give its decision by a majority of the Justices of that Court and such decision shall be pronounced by the Chief Justice or any other of the Justices as the Court shall direct."
        },
        {
          "number": 29,
          "title": "Public Emergency",
          "content": "(1) Whenever in the opinion of the President a state of public emergency is imminent or has commenced, the President may, at any time, by Proclamation which shall be published in the Gazette, declare that—\n\n(a) a state of public emergency exists either in any part, or in the whole of Sierra Leone; or\n\n(b) a situation exists which, if it is allowed to continue, may lead to a state of public emergency in any part of or the whole of Sierra Leone.\n\n(2) The President may issue a Proclamation of a state of public emergency only when—\n\n(a) Sierra Leone is at war;\n\n(b) Sierra Leone is in imminent danger of invasion or involvement in a state of war; or\n\n(c) there is actual breakdown of public order and public safety in the whole of Sierra Leone or any part thereof to such an extent as to require extraordinary measures to restore peace and security; or\n\n(d) there is a clear and present danger of an actual breakdown of public order and public safety in the whole of Sierra Leone or any part thereof requiring extraordinary measures to avert the same; or\n\n(e) there is an occurrence of imminent danger, or the occurrence of any disaster or natural calamity affecting the community or a section of the community in Sierra Leone; or\n\n(f) there is any other public danger which clearly constitutes a threat to the existence of Sierra Leone.\n\n(3) Every declaration made under subsection (1) shall lapse—\n\n(a) in the case of a declaration made when Parliament is sitting at the expiration of a period of seven days beginning with the date of publication of the declaration; and\n\n(b) in any other case, at the expiration of a period of twenty-one days beginning with the date of the declaration,\n\nunless it has in the meantime been approved by or superseded by a Resolution of Parliament supported by the votes of two-thirds of the Members of Parliament.\n\n(4) A declaration made under subsection (1) may at any time before being superseded by a Resolution of Parliament be revoked by the President by Proclamation which shall be published in the Gazette, and all measures taken thereunder shall be deemed valid and lawful and shall not be enquired into by any curt or tribunal.\n\n(5) During a period of public emergency, the President may make such regulations and take such measures as appear to him to be necessary or expedient for the purpose of maintaining and securing peace, order and good government in Sierra Leone or any part thereof.\n\n(6) Without derogating from the generality of the powers conferred by subsection (5) and notwithstanding the provisions of this Chapter, the regulations or measures may, so far as appears to the President to be necessary or expedient for any of the purposes mentioned in that subsection—\n\n(a) make provision for the detention of persons, the restriction of the movement of persons within defined localities, and the deportation and exclusion of persons other than citizens of Sierra Leone from Sierra Leone or any part thereof;\n\n(b) authorise—\n\n(i) the taking of possession or control on behalf of the Government of any property or undertaking;\n\n(ii) the acquisition on behalf of the Government of any property other than land;\n\n(c) authorise the entering and search of any premises;\n\n(d) amend any law, suspend the operation of any law, and apply any law with or without modification;\n\nProvided that such amendment, suspension or modification shall not apply to this Constitution;\n\n(e) provide for charging, in respect of the grant of issue of any license, permit, certificate or other document for the purpose of the regulations, such fees as may be prescribed by or under the regulations;\n\n(f) provide for payment of compensation and remuneration to persons affected by the regulations;\n\n(g) provide for the apprehension, trial and punishment of persons offending against the regulations;\n\n(h) provide for maintaining such supplies and services as are, in the opinion of the President, essential to the life and well-being of the community;\n\nProvided that nothing in this subsection shall authorise the making of regulations during a period of public emergency for the trial of persons who are not members of defence forces by military courts.\n\n(7) The payment of any compensation or remuneration under the provisions of such regulations shall be a charge upon the Consolidated Fund.\n\n(8) Regulations made under this section shall apply to the whole of Sierra Leone or to such parts thereof as may be specified in the regulations.\n\n(9) Regulations made under this section may provide for empowering such authorities or persons as may be specified in the regulations to make Orders and Rules for any of the purposes for which the regulations are authorised by this Constitution to be necessary or expedient for the purposes of the regulations.\n\n(10)\n\n(a) Every regulation or measure taken under this section and every order or rule made in pursuance of such a regulation shall, without prejudice to the validity of anything lawfully done thereunder, cease to have effect ninety days from the date upon which it comes into operation unless before the expiration of the period, it has been approved by resolution passed by Parliament.\n\n(b) Any such regulation, order or rule may, without prejudice to the validity of anything lawfully done thereunder at any time be amended or revoked by the President.\n\n(11) Subject to the provisions of subsections (7) and (8) of section 23, every regulation made under this section and every order or rule made in pursuance of such a regulation shall have effect notwithstanding anything inconsistent therewith contained in any law; and any provision of a law which is inconsistent with any such regulation, order or rule shall, whether that provision has or has not been amended, modified or suspended in its operation under any Act, cease to have effect to the extent that such regulation, order or rule remains in force.\n\n(12) A declaration made under subsection (1) that has been approved by or superseded by a resolution of Parliament in pursuance of subsection (2) shall, subject to the provisions of subsection (3), remain in force as long as that resolution remains in force.\n\n(13) A resolution of Parliament passed for the purpose of this section shall remain in force for a period of twelve months or such shorter period as may be specified therein;\n\nProvided that any such resolution may be extended from time to time by a further such resolution, supported by the votes of two-thirds of Members of Parliament, each extension not exceeding twelve months from the date of the resolution effecting the extension; and any such resolution may be revoked at any time by a resolution supported by the votes of a simple majority of all the Members of Parliament.\n\n(14) Any provision of this Section that a declaration made under subsection (1) shall lapse or cease to be in force at any particular time is without prejudice to the making of a further such declaration whether before or after that time.\n\n(15) Every document purporting to be an instrument made or issued by the President or other authority or person in pursuance of this section, or of any regulation made thereunder and to be signed by or on behalf of the President or such other authority or person, shall be received in evidence, and shall, until the contrary be proved, be deemed to be an instrument made or issued by the President or that authority or person.\n\n(16) The President may summon Parliament to meet for the purpose of subsection (2) notwithstanding that Parliament then stands dissolved, and the persons who were Members of Parliament immediately before the dissolution shall be deemed, for those purposes, still to be Members of Parliament but subject to the provisions of section 79 of this Constitution (which relates to the election of the Speaker of Parliament), without prejudice to the provisions of section 85 of this Constitution (which relates to the prolongation of the life of Parliament during a period of public emergency). Parliament shall not when summoned by virtue of this subsection transact any business other than debating and voting upon a resolution for the purpose of subsection (2).\n\n(17) During a period of detention—\n\n(a) if any person who is detained in such a case as is mentioned in paragraph (a) of subsection (6) and who is not released so requests at any time not earlier than thirty days after he last made such a request during that period, his case shall be reviewed by an independent and impartial tribunal established by law, comprising not more than three persons from amongst persons of not less than fifteen year's standing entitled to practise in Sierra Leone as legal practitioners;\n\n(b) the Chairman of the tribunal, set up under paragraph (a) shall be appointed by the Chief Justice, and the two other members shall be nominated by the Sierra Leone Bar Association;\n\n(c) on any review by a tribunal in pursuance of paragraph (a) of the case of any detained person, the tribunal may made recommendations concerning the necessity or expediency of continuing his detention to the authority by whom it was ordered, but unless it is otherwise provided by law, that authority shall not be obliged to act in accordance with any such recommendation.\n\n(18) Nothing contained in or done under the authority of any law shall beheld to be inconsistent with or in contravention of this section to the extent that the law in question authorises the taking during a period of a state of public emergency of measures that are reasonably justifiable for the purpose of dealing with the situation that exists immediately before and during that period of a state of public emergency."
        },
        {
          "number": 30,
          "title": "Interpretation of Chapter III.",
          "content": "(1) In this Chapter, unless the context otherwise requires, the following expressions have the following meanings respectively, that is to say—\n\n\"contravention\" in relation to any requirement includes a failure to comply with that requirement, and cognate expressions shall be construed accordingly;\n\n\"court\" means any court of law in Sierra Leone other than a local court or a court constituted by or under service law and—\n\n(a) in section 16, section 17, section 18, section 19, subsections (3), (5), (6), (9) (but not the proviso thereto) and (11) of Section 23, subsection (2) of section 25, subsection 8 of section 27, subsection (3) of section 28 and subsection (4) of section 29 includes, in relation to an offence against service law, a court so constituted; and\n\n(b) in sections 17 and 19, and subsection (8) of section 27, includes, in relation to an offence against service law, an officer of a defence force or of the Sierra Leone Police Force.\n\n\"defence force\" means any naval, military or airforce of the Government of the Republic of Sierra Leone;\n\n\"member\" in relation to a defence force or other disciplined force, includes any person who, under the law regulating the discipline of that force, is subject to that discipline;\n\n\"owner\" includes any person or his successor in title deprived of any right or interest pursuant to section 21, and\n\n\"service law\" means the law regarding the discipline of a defence force or of the Sierra Leone Police Force or the Prisons Service or any disciplined volunteer force.\n\n(2) References in sections 16, 17, 18 and 21 to a \"criminal offence\" shall be construed as including references to an offence against service law and such references in subsections (4) to (9) of section 23 shall, in relation to proceedings before a court constituted by or under service law, be similarly construed.\n\n(3) Nothing done by or under the authority of the law of any country other than Sierra Leone to a member of an armed force raised under that law and lawfully present in Sierra Leone shall be held to be in contravention of the provisions of this Chapter.\n\n(4) In relation to any person who is a member of a disciplined force raised under an Act of Parliament, nothing contained in or done under the authority of the disciplinary law of that force shall be held to be inconsistent with or in contravention of any of the provisions of this Chapter.\n\n(5) In relation to any person who is a member of a disciplined force raised otherwise than as aforesaid and lawfully present in Sierra Leone, nothing contained in or done under the authority of the disciplinary law of that force shall be held to be inconsistent with or in contravention of any of the provisions of this Chapter.\n\n(6) In determining the appropriated \"majority of all Members of Parliament\" account shall only be taken of the persons actually and validly existing as Members of Parliament at the relevant time."
        }
      ]
    },
    {
      "title": "THE REPRESENTATION OF THE PEOPLE",
      "number": 4,
      "sections": [
        {
          "number": 31,
          "title": "Registration of voters.",
          "content": "Every citizen of Sierra Leone being eighteen years of age and above and of sound mind shall have the right to vote, and accordingly shall be entitled to be registered as a voter for the purposes of public elections and referendum."
        },
        {
          "number": 32,
          "title": "Electoral Commission",
          "content": "(1) There shall be an Electoral Commission for Sierra Leone.\n\n(2) The members of the Electoral Commission shall be a Chief Electoral Commissioner, who shall be Chairman, and four other members who shall be known as Electoral Commissioners.\n\n(3) The members of the Electoral Commission shall be appointed by the President after consultation with the leaders of all registered political parties and subject to the approval of Parliament.\n\n(4) A person shall not be qualified—\n\n(a) for appointment as a member of the Electoral Commission if he is not qualified to be elected as a Member of Parliament, or\n\n(b) to hold office as a member of the Electoral Commission if he is a Minister, a Deputy Minister, a Member of Parliament, or a public officer, or if he has attained the age of sixty-five years.\n\n(5) The terms and conditions of service of members of the Electoral Commission shall be such as Parliament shall prescribe.\n\n(6) A member of the Electoral Commission shall before assuming the functions of his office, take and subscribe before the President the Oath as set out in the Third Schedule to this Constitution.\n\n(7) Subject to the provisions of this section, a member of the Electoral Commission shall vacate his office—\n\n(a) at the expiration of five years from the date of his appointment; or\n\n(b) on attaining the age of sixty-five years; or\n\n(c) if any circumstances arise which, if he were not a member of the Commission, would cause him to be disqualified for appointment as such.\n\n(8) A member of the Electoral Commission may be removed from office by the President for inability to discharge functions of his office (whether arising from infirmity of mind or body or any other cause) or for misbehaviour.\n\n(9) A member of the Electoral Commission shall not be removed from office except in accordance with the provisions of this section.\n\n(10) Whenever a member of the Electoral Commission dies, resigns, is removed from office, or is absent from Sierra Leone, or is by reason of illness or any other cause unable to perform the functions of his office, the President may appoint a person who is qualified to be appointed Electoral Commissioner and any person so appointed shall, subject to the provisions of subsections (6) and (7), continue to perform those functions until his appointment is revoked by the President, or until the Electoral Commissioner is able to perform those functions, or until the appointment of a new Electoral Commissioner.\n\n(11) In the exercise of any functions vested in it by the Constitution, the Electoral Commission shall not be subject to the direction or control of any person or authority.\n\n(12) the Chief Electoral Commissioner shall submit a report on the programme and work of the Electoral Commission at least once a year to the President and a copy of such report shall be laid before Parliament."
        },
        {
          "number": 33,
          "title": "Functions of the Electoral Commission.",
          "content": "Subject to the provisions of the Constitution, the Electoral Commission shall be responsible for the conduct and supervision of the registration of voters for, and of, all public elections and referenda; and for that purpose shall have power to make regulations by statutory instrument for the registration of voters, the conduct of Presidential, Parliamentary or Local Government elections and referenda, and other matters connected therewith, including regulations for voting by proxy."
        },
        {
          "number": 34,
          "title": "Political Parties Registration Commission.",
          "content": "(1) There shall be a Political Parties Registration Commission which shall consist of four members appointed by the President, namely—\n\n(a) the Chairman of the Commission, who shall be a person who has held Judicial office or is qualified to be appointed a Judge of the Superior Court of Judicature nominated by the Judicial and Legal Service Commission;\n\n(b) the Chief Electoral Commissioner;\n\n(c) a legal practitioner nominated by the Sierra Leone Bar Association; and\n\n(d) a member nominated by the Sierra Leone Labour Congress.\n\n(2) The members of the Commission, other than the Chief Electoral Commissioner, shall be appointed by the President subject to the approval of Parliament.\n\n(3) The Administrator and Registrar-General shall be Secretary to the Commission.\n\n(4) The Commission shall be responsible for the registration of all political parties and for that purpose may make such regulations as may be necessary for the discharge of its responsibilities under this Constitution;\n\nProvided that the first registration of political parties after the coming into force of this Constitution shall be undertaken by the Electoral Commission.\n\n(5) In the exercise of any function vested in it by this Constitution, the Commission shall not be subject to the direction or control of any person or authority, save only as regards the right to appeal contained in section 35."
        },
        {
          "number": 35,
          "title": "Registration and conduct of political parties.",
          "content": "(1) Subject to the provisions of this section, political parties may be established to participate in shaping the political will of the people, to disseminate information on political ideas, and social and economic programmes of a national character, and to sponsor candidates for Presidential, Parliamentary or Local Government elections.\n\n(2) The internal organisation of a political party shall conform to democratic principles, and its aims, objectives, purposes and programmes shall not contravene, or be inconsistent with, any provisions of this Constitution.\n\n(3) A statement of the sources of income and the audited accounts of a political party, together with a statement of its assets and liabilities, shall be submitted annually to the Political Parties Registration Commission, but no such account shall be audited by a member of the political party whose account is submitted.\n\n(4) No political party shall have as a leader a person who is not qualified to be elected as a Member of Parliament.\n\n(5) No association, by whatever name called, shall be registered or be allowed to operate or to function as a political party if the Political Parties Registration Commission is satisfied that—\n\n(a) membership or leadership of the party is restricted to members of any particular tribal or ethnic group or religious faith; or\n\n(b) the name, symbol, colour or motto of the party has exclusive or particular significance or connotation to members of any particular tribal or ethnic group or religious faith; or\n\n(c) the party is formed for the sole purpose of securitng or advancing the interests and welfare of a particular tribal or ethnic group, community, geographical area or religious faith; or\n\n(d) the party does not have a registered office in each of the Provincial Headquarter towns and the Western Area.\n\n(6) Subject to the provisions of this Constitution, and in furtherance of the provisions of this section, Parliament may make laws regulating the registration, functions and operation of political parties.\n\n(7) Any association aggrieved by a decision of the Political Parties Registration Commission under this section may appeal to the Supreme Court and the decision of the Court shall be final.\n\n(8) For the purposes of this section the expression—\n\n\"association\" includes any body of persons, corporate or incorporate, who agree to act together for any common purpose, or an association formed for any ethnic, social, cultural, occupational or religious purpose; and\n\n\"political party\" means any association registered as a political party as prescribed by subsection (5)."
        },
        {
          "number": 36,
          "title": "Secret ballot.",
          "content": "At any public elections or referenda voting shall be by secret ballot."
        },
        {
          "number": 37,
          "title": "Referendum",
          "content": "(1) In any referendum held pursuant to an Act of Parliament, every person who is entitled to vote in elections of Members of Parliament shall be entitled to vote at such referendum and no other person may so vote; and the issue in the referendum shall not be regarded as having been approved at that referendum unless it was so approved by the votes of not less than one-half of all such persons or by not less than two-thirds of all the valid votes cast.\n\n(2) The conduct of any referendum for the purposes of subsection (1) shall be under the general supervision of the Electoral Commission and the provisions of Section 38 of this Constitution shall apply in relation to the exercise by the Electoral Commission of its functions with respect to a referendum as they apply in relation to the exercise of its functions with respect to elections of Members of Parliament.\n\n(3) A Bill for an Act of Parliament under this Section shall not be submitted to the President for his assent unless it is accompanied by a certificate under the hand of the Speaker (or if the Speaker is for any reason unable to exercise the functions of this office, the Deputy Speaker) that the provisions of subsections (1), (2) and (3) of section 106 and, where appropriate, the provisions of subsections (1) and (2) have been complied with."
        },
        {
          "number": 38,
          "title": "Constituencies and elections.",
          "content": "(1) Sierra Leone shall be divided into such constituencies for the purpose of electing the Members of Parliament referred to in paragraph (b) of subsection (1) of section 74 of this Constitution as the Electoral Commission, acting with the approval of Parliament signified by resolution of Parliament, may prescribe.\n\n(2) Every constituency established under this section shall return one Member of Parliament.\n\n(3) The boundaries of each constituency shall be such that the number of inhabitants thereof is as nearly equal to the population quota as is reasonably practicable.\n\nProvided that the number of inhabitants of such a constituency may be greater or less than the population quota in order to take account of means of communications, geographical features, density of population, the distribution of different commodities, the areas and boundaries of the Chiefdoms and other administrative or traditional areas.\n\n(4) The Electoral Commission shall review the division of Sierra Leone into constituencies at intervals of not less than five and not more than seven years, and may alter the constituencies in accordance with the provisions of this section to such extent as it may consider desirable in the light of the review;\n\nProvided that the Commission may at any time carry out such a review and alter the constituencies in accordance with the provisions of this section to such extent as it considers necessary in consequence of any alteration in the number of Members of Parliament referred to in paragraph (b) of subsection (1) of section 74 by reason of the holding of a census of the population of Sierra Leone in pursuance of an Act of Parliament.\n\n(5) Where the boundaries of any constituency are altered in accordance with the provisions of this section, that alteration shall come into effect upon the next dissolution of Parliament after the alteration has been approved by Parliament.\n\n(6) In this section \"population quota\" means the number obtained by dividing the number of inhabitants of Sierra Leone by the number of constituencies into which Sierra Leone is divided under this section.\n\n(7) For the purposes of this section the number of inhabitants of Sierra Leone shall be ascertained by reference to the latest census of the population of Sierra Leone held in pursuance of an Act of Parliament or if no census has been so held, by reference to any available information, which in the opinion of the Electoral Commission best indicates the number of those inhabitants.\n\n(8) The registration of voters and the conduct of elections in every constituency shall be subject to the direction and supervision of the Electoral Commission, and it shall cause the register of voters to be revised and reviewed at least once in every three years."
        },
        {
          "number": 39,
          "title": "Filling of vacancies.",
          "content": "(1) When the seat of any member of Parliament becomes vacant, the vacancy shall be filled by election, not later than six months after the vacancy occurs, in accordance with the provisions of law relating to such election;\n\nProvided that if Parliament is dissolved before such election is due to be held, the vacancy shall be filled at the general election.\n\n(2) The Proclamation appointing a date for the holding of an election to fill a vacancy shall be published in the Gazette not less than twenty-one days before the date appointed for holding the election."
        }
      ]
    },
    {
      "title": "THE EXECUTIVE",
      "number": 5,
      "parts": [
        {
          "header": "THE PRESIDENT",
          "sections": [
            {
              "number": 40,
              "title": "Office of President.",
              "content": "(1) There shall be a President of the Republic of Sierra Leone who shall be Head of State, the supreme executive authority of the Republic and the Commander-in-Chief of the Armed Forces.\n\n(2) The President shall be the Fountain of Honour and Justice and the symbol of national unity and sovereignty.\n\n(3) The President shall be the guardian of the Constitution and the guarantor of national independence and territorial integrity, and shall ensure respect for treaties and international agreements.\n\n(4) Notwithstanding any provisions of this Constitution or any other law to the contrary, the President shall, without prejudice to any such law as may for the time being be adopted by Parliament, be responsible, in addition to the functions conferred upon him in the Constitution, for—\n\n(a) all constitutional matters concerning legislation;\n\n(b) relations with Foreign States;\n\n(c) the reception of envoys accredited to Sierra Leone and the appointment of principal representatives of Sierra Leone abroad;\n\n(d) the execution of treaties, agreements or conventions in the name of Sierra Leone;\n\n(e) the exercise of the Prerogative of Mercy;\n\n(f) the grant of Honours and Awards;\n\n(g) the declaration of war; and\n\n(h) such other matters as may be referred to the President by Parliament;\n\nProvided that any Treaty, Agreement or Convention executed by or under the authority of the President which relates to any matter within the legislative competence of Parliament, or which in any way alters the law of Sierra Leone or imposes any charge on, or authorises any expenditure out of, the Consolidated Fund or any other fund of Sierra Leone, and any declaration of war made by the President shall be subject to ratification by Parliament—\n\n(i) by an enactment of Parliament; or\n\n(ii) by a resolution supported by the votes of not less than one-half of the Members of Parliament."
            },
            {
              "number": 41,
              "title": "Qualifications for Office of President.",
              "content": "No person shall be qualified for election as President unless he—\n\n(a) is a citizen of Sierra Leone;\n\n(b) is a member of a political party;\n\n(c) has attained the age of forty years; and\n\n(d) is otherwise qualified to be elected as a Member of Parliament."
            },

            {
              "number": 42,
              "title": "Election of President.",
              "content": "(1) A Presidential candidate shall be nominated by a political party.\n\n(2) The following provisions shall apply to an election to the office of President—\n\n(a) all persons registered in Sierra Leone as voters for the purposes of election to Parliament shall be entitled to vote in the election;\n\n(b) the poll shall be taken by a secret ballot on such day or days, at such time, and in such manner as may be prescribed by or under an Act of Parliament;\n\n(c) a candidate for an election to the office of President shall be deemed to have been duly elected to such office where he is the only candidate nominated for the election after the close of nomination;\n\n(d) where in an election to the office of President a candidate nominated for the election dies, is incapacitated or disqualified, the party which nominated him shall within seven days of such death, incapacitation or disqualification, nominate another candidate;\n\n(e) no person shall be elected as President of Sierra Leone unless at the Presidential election he has polled not less than fifty-five per cent of the valid votes in his favour; and\n\n(f) in default of a candidate being duly elected under paragraph (e), the two candidates with the highest number or numbers of votes shall go forward to a second election which shall be held within fourteen days of the announcement of the result of the previous election, and the candidate polling the higher number of votes cast in his favour shall be declared President.\n\n(3) A person elected to the office of President under this section shall assume that office on the day upon which he is declared elected by the Returning Officer, or upon the date that his predecessor's term of office expires, whichever is the latter."
            },
            {
              "number": 43,
              "title": "Period during which Presidential election shall take place.",
              "content": "A Presidential election shall take place—\n\n(a) where the office of President is to become vacant by effluxion of time and the President continues in office after the beginning of the period of four months ending with the date\n\n(b) when his term of office would expire by effluxion of time, during the first three months of that period;\nin any other case, during the period of three months beginning with the date when the office of President becomes vacant;\n\nProvided that—\n\n(a) where any proceedings have been lawfully commenced or taken for the purposes of the election and assumption of office of a President, it shall not be recommended or retaken whether or not a President has thereby been duly elected, by reason only that a vacancy has occurred in the office of President otherwise than by effluxion of time; and the said proceedings shall, subject to the provision of this Constitution, be continued and committed in accordance with this Constitution and any other law for the time being in force relating thereto, with such modification as may be necessary; and\n\n(b) where the office of President becomes vacant during a period when Parliament is dissolved, the Presidential election shall be held and completed before the election of Members of Parliament."
            },

            {
              "number": 44,
              "title": "Parliament to make laws for election of President.",
              "content": "Parliament shall make laws for the purpose of regulating the election of President and other matters connected therewith."
            },
            {
              "number": 45,
              "title": "Presidential Returning Officer.",
              "content": "(1) The Chief Electoral Commissioner shall be the Returning Officer for the election of a President.\n\n(2) Any question which may arise as to whether—\n\n(a) any provision of this Constitution or any law relating to the election of a President under sections 42 and 43 of this Constitution has been complied with; or\n\n(b) any person has been validly elected as President under section 42 of this Constitution or any other law,\nshall be referred to and determined by the Supreme Court."
            },

            {
              "number": 46,
              "title": "Tenure of office of President, etc.",
              "content": "(1) No person shall hold office as President for more than two terms of five years each whether or not the terms are consecutive.\n\n(2) Any person who is elected President while he is, or has been elected a Member of Parliament shall, on assuming office as President, cease to be an elected Member of Parliament and his seat shall be declared vacant.\n\n(3). The President shall not, while he continues in office as President, hold any other office of profit or emolument in the service of Sierra Leone or occupy any other position carrying the right to remuneration for rendering services.\n\n(4) Upon his assumption of office, the President shall take and subscribe the oath for the due execution of his office as set out in the Second Schedule to this Constitution.\n\n(5) The oath aforesaid shall be administered by the Chief Justice of Sierra Leone or the person for the time being appointed to exercise the functions of the Chief Justice."
            },

            {
              "number": 47,
              "title": "President in Parliament.",
              "content": "The President shall be entitled to address Parliament in person or to send a message to Parliament to be read by his Vice-President or a Minister on his behalf."
            },
            {
              "number": 48,
              "title": "Incidents of office, etc.",
              "content": "(1) The President shall receive such salary and allowances as may be prescribed by Parliament and such salary and allowances payable to the President are hereby charged on the Consolidated Fund.\n\n(2) The salary and allowances of the President shall not be altered to his disadvantage during his tenure of office.\n\n(3) The President shall be exempted from personal taxation.\n\n(4) While any person holds or performs the functions of the office of President, no civil or criminal proceedings shall be instituted or continued against him in respect of anything done or omitted to be done by him either in his official or private capacity.\n\n(5) The President shall be entitled to such pension and retiring benefits as shall be prescribed by Parliament."
            },

            {
              "number": 49,
              "title": "Vacancy in office of President.",
              "content": "(1) The office of President shall become vacant—\n\n(a) on the expiration of any of the terms prescribed in subsection (1) of section 46 of this Constitution; or\n\n(b) where the incumbent dies or resigns or retires from that office; or\n\n(c) where the incumbent ceases to hold that office in pursuance of section 50 or 51 of this Constitution:\n\nProvided that the President shall not resign or retire from this office even at the due expiration of his term of office while a general election of Members of Parliament is pending within the ensuing three months, or where a state of public emergency has been declared.\n\n(2) If Sierra Leone is at war in which the national territory is physically involved, and the President considers that it is not practicable to hold elections, Parliament may by resolution extend the period of five years mentioned in sub-section (1) of section 46, but no such extension shall exceed a period of six months at any one time.\n\n(3) Any resignation or retirement by a person from the office of President shall be in writing addressed to the Chief Justice and a copy thereof shall be sent to the Speaker and the Chief Electoral Commissioner.\n\n(4) Whenever the President dies, resigns, retires or is removed from office as a result of paragraphs (b) and (c) of subsection (1), the Vice-President shall assume office as President for the unexpired term of the President with effect from the date of the death, resignation, retirement or removal of the President, as the case may be.\n\n(5) The Vice-President shall, before assuming office as President in accordance with subsection (4), take and subscribe the oath for the due execution of his office as set out in the Second Schedule to this Constitution."
            },
            {
              "number": 50,
              "title": "Mental or physical incapacity.",
              "content": "(1) Where the Cabinet has resolved that the question of the mental or physical capacity of the President to discharge the functions conferred on him by this Constitution ought to be investigated and has informed the Speaker accordingly, the Speaker shall, in consultation with the Head of the Medical Service of Sierra Leone, appoint a Board consisting of not less than five persons selected by him from among persons registered as medical practitioners under the laws of Sierra Leone.\n\n(2) The Board appointed under subsection (1) shall enquire into the matter and make a report to the Speaker stating the opinion of the Board whether or not the President is, by reason of any infirmity of mind or body, incapable of discharging the functions conferred on the President by this Constitution.\n\n(3) Where the Cabinet has resolved that the question of the mental or physical capacity of the President to discharge the functions conferred on him by this Constitution ought to be investigated in accordance with the provisions of subsection (1), the President shall, as soon as another person assumes the office of President, cased to perform those functions and until the Board submits its report, those functions shall be exercised in accordance with subsection (1) of section 52 of this Constitution.\n\n(4) Where the Board reports that the President is incapable of discharging the functions conferred on him by this Constitution by reason of infirmity of mind or body, the Speaker shall certify in writing accordingly, and thereupon, the President shall cease to hold office and a vacancy shall be deemed to have occurred in the office of President and subsection (4) of section 49 of this Constitution shall apply.\n\n(5) Upon receipt of the report of the Board referred to in subsection (4), the speaker shall—\n\n(a) if Parliament is then sitting or has been summoned to meet, within five days communicate the report to Parliament;\n\n(b) if Parliament is not then sitting (and notwithstanding that it may be prorogued), summon Parliament to meet within twenty-one days after the receipt by the Speaker of the report of the Board and communicate the report of the Board to Parliament.\n\n(6) For the purposes of this section—\n\n(a) the Cabinet may act notwithstanding any vacancy in its membership or the absence of any member;\n\n(b) a Certificate by the Speaker that the President is by reason of mental or physical infirmity unable to discharge the functions of the office of President conferred on him by this Constitution shall, in respect of any period for which it is in force, be conclusive and shall not be entertained or enquired into in any court."
            },
            {
              "number": 51,
              "title": "Misconduct by President.",
              "content": "(1) If notice in writing is given to the Speaker signed by not less than one-half of all the Members of Parliament of a motion alleging that the President has committed any violation of the Constitution or any gross misconduct in the performance of the functions of his office and specifying the particulars of the allegations and proposing that a tribunal be appointed under this section to investigate those allegations, the Speaker shall—\nif Parliament is then sitting or has been summoned to meet within five days, cause the motion to be considered by Parliament within seven days of the receipt of the notice; or\nif Parliament is not then sitting (and notwithstanding that it may be prorogued), summon Parliament to meet within twenty-one days of the receipt of the notice, and cause the motion to be considered by Parliament.\n\n(2) Where a motion under this section is proposed for consideration by Parliament, it shall meet in secret session and shall not debate the motion, but the Speaker or the person presiding in Parliament shall forthwith cause a vote to be taken on the motion and, if the motion is supported by the votes of not less than two thirds of all Members of Parliament, shall declare the motion to be passed.\n\n(3). If a motion is declared to be passed under subsection (2)—\n\n(a) the Speaker shall immediately notify the Chief Justice who shall appoint a tribunal which shall consist of a Chairman who shall be a Justice of the Supreme Court and not less than four others selected by the Chief Justice, at least two of whom shall hold or shall have held high judicial office;\n\n(b) the Tribunal shall investigate the matter and shall within the period of three months from the date on which the motion was passed report to Parliament through the Speaker whether or not it finds the particulars of the allegation specified in the motion to have been sustained;\n\n(c) the President shall have the right to appear and be represented before the Tribunal during its investigation of the allegations against him.\n\n(4) If the Tribunal reports to Parliament that if finds that the particulars of any allegations against the President specified in the motion have not been substantiated, no further proceedings shall be taken under this Section in respect of that allegation.\n\n(5) Where the Tribunal reports to Parliament that it finds that the particulars of any allegation specified in the motion have been substantiated, Parliament may, in secret session, on a motion supported by not less than two-thirds of all the Members of Parliament, resolve that the President has been guilty of such violation of the Constitution or, as the case may, such gross misconduct as is incompatibile with his continuance in office as President; and where Parliament so resolves, the President shall thereupon cease to hold office and a vacancy shall then be deemed to have occurred in the office of President and subsection (4) of Section 49 of this Constitution shall apply accordingly."
            },
            {
              "number": 52,
              "title": "Temporary filling of vacancy.",
              "content": "(1) Whenever the President is absent from Sierra Leone or is by reason of illness or any other cause unable to perform the functions conferred upon him by this Constitution, those functions shall be performed by the Vice-President.\n\n(2) Upon assumption of office under subsection (1), the Vice-President shall not take and subscribe the oath of office of President."
            }
          ]
        },
        {
          "header": "Part 2 - EXECUTIVE POWERS",
          "sections": [
            {
              "number": 53,
              "title": "Sessions of Parliament",
              "content": "(1) Each session in Parliament shall be held at such place within Sierra Leone and shall commence at such time as the President may be Proclamation appoint.\n(2) There shall be a session of Parliament at least once in every year, so that a period of twelve months shall not intervene between the last sitting of Parliament in one session and the first sitting thereof in the next session:\n\nProvided that there shall be a session of Parliament not later than twenty-eight days from the holding of a general election of Members of Parliament.\n\n(3) The President shall at the beginning of each session of Parliament present to Parliament an address on the state of the nation."
            },
            {
              "number": 54,
              "title": "Life of Parliament",
              "content": "(1) Parliament shall stand dissolved at the expiration of a period of five years commencing from the date of its first sitting after a general election.\n\n(2) If there is in existence a state of public emergency in accordance with section 29 of this Constitution and the President considers it not practicable to hold elections, Parliament may, by resolution, extend the period of five years mentioned in subsection (1) from time to time but not beyond a period of six months at any one time"
            }
          ]
        }
      ]
    },
    {
      "title": "THE LEGISLATURE",
      "number": 6,
      "parts": [
        {
          "header": "Part 1",
          "sections": [
            {
              "number": 73,
              "title": "Establishment of Parliament",
              "content": "(1) There shall be a legislature of Sierra Leone which shall be known as Parliament, and shall consist of the President, the Speaker and Members of Parliament.\n\n(2) Subject to the provisions of this Constitution, the legislative power of Sierra Leone is vested in Parliament.\n\n(3) Parliament may make laws for the peace, security, order and good government of Sierra Leone."
            },
            {
              "number": 74,
              "title": "Members of Parliament",
              "content": "(1) Members of Parliament shall comprise the following—\n\n(a) one Member of Parliament for each District who shall, subject to the provisions of this Constitution, be elected in such manner as may be prescribed by or under any law from among the persons who, under any law, are for the time being Paramount Chiefs; and\n\n(b) such number of Members as Parliament may prescribe who, subject to the provisions of this Constitution, shall be elected in such manner as may be prescribed by or under any law.\n\n(2) The number of Members of Parliament to be elected pursuant to paragraphs (a) and (b) of subsection (1) shall not together be less than sixty.\n\n(3) In any election of Members of Parliament the votes of the electors shall be given by ballot in such manner as not to disclose how any particular elector votes.\n\n(4) Members of Parliament shall be entitled to such salaries, allowances, gratuities, pensions and such other benefits as may be prescribed by Parliament."
            }
          ]
        },
        {
          "header": "Part 2 - SUMMONING, PROROGATION AND DISSOLUTION",
          "sections": [
            {
              "number": 84,
              "title": "Sessions of Parliament",
              "content": "(1) Each session in Parliament shall be held at such place within Sierra Leone and shall commence at such time as the President may be Proclamation appoint.\n(2) There shall be a session of Parliament at least once in every year, so that a period of twelve months shall not intervene between the last sitting of Parliament in one session and the first sitting thereof in the next session:\n\nProvided that there shall be a session of Parliament not later than twenty-eight days from the holding of a general election of Members of Parliament.\n\n(3) The President shall at the beginning of each session of Parliament present to Parliament an address on the state of the nation."
            },
            {
              "number": 85,
              "title": "Life of Parliament",
              "content": "(1) Parliament shall stand dissolved at the expiration of a period of five years commencing from the date of its first sitting after a general election.\n\n(2) If there is in existence a state of public emergency in accordance with section 29 of this Constitution and the President considers it not practicable to hold elections, Parliament may, by resolution, extend the period of five years mentioned in subsection (1) from time to time but not beyond a period of six months at any one time"
            }
          ]
        }
      ]
    }
  ]
}